title: Suspicious Powershell Encrypted String
status: experimental
description: Detects
author: Andrew Bannon
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        Image: '*\cmd.exe'
        Commandline:
          - '*convertto-securestring*'
          - '*-key*'
        ParentImage:
          - '*\WINWORD.exe'
          - '*\EXCEL.exe'
    condition: selection
falsepositives:
    - unlikely
level: medium
